# list = [1,2,3,4,5,6]
# print(list) 
# print(list[-1])
# print(list[1::])
# print(list[::3])
# print(list[:-1]) 
# # [_:_:_]начало край стъпка 
# # кортежи --> индекс- извежда идекс; count and index 

# #сетове няма повтарящи се елементи 



# потребител въвежда цяло число, а програмата формира два кортежа, 
# състоящи се от цифрите в това число, 
# единият кортеж да е със цифрите в прав ред, а вторият в обратен ред


# n = int(input("Въведи n: "))
 
# t1 = tuple(str(n))
# t2 = tuple(str(n)[::-1])
 
# print(t1, t2)



# програма, която създава числов списък. Той се запълва със случайни числа, 
# вмъква се нов елемент между всяка двойка елементи, равен на сбор на съседните два елемента   

# import random
# n = int(input("Enter number of elements: "))
# list = []
# new_list = []
# for i in range(n):  
#     value = random.randint(1, 100)
#     list.append(value)
# print(list)

# for t in range (len(list)-1): 
#     new_list.append(list[t])
#     new_list.append(list[t] + list[t+1])

# print (new_list)   



#въвежда текст, на негова база се създава речник, 
# text = input("Въведи текст: ")
# dictionary = {}
 
# for char in text:
#     if char == " ":
#         continue
#     if char not in dictionary:
#         dictionary [char] = 1
#     else:
#         dictionary [char] += 1
 
# print(dictionary)



# #Напишете програма, в която потребителя въвежда чяло число. От него се
# създава списък състоящ се от числата от 1 до това число . Въз основа на този
# списък се създава речник, в който елементите на списъка служат за ключове
# на елементите на речника , а стойностите на тези елементи в речника са
# елементите на списъка но в обратен ред.
# Пример : ако сме въвели числото 4 , създава се списъка [1,2,3,4 ] и на негова
# основа се създава речник с 4 елемента : {1:4, 2:3, 3:2, 4:1}

n = int(input)
